config.org
#+STARTUP: hidestars

* INFORMATION
  #+begin_src emacs-lisp
(setq user-full-name "WALID LAARAKI"
      user-mail-address "wlaaraki@gmail.com"
      user-home-directory (concat (getenv "HOME")"/")
      user-emacs-directory (concat user-home-directory ".emacs.d/")
      custom-file (expand-file-name "custom.el" user-emacs-directory))
(load custom-file)
  #+end_src
* INTERFACE
** THEMES
*** ZENBURN
    #+begin_src emacs-lisp
(use-package zenburn-theme
  :ensure t
  :pin melpa
  :config
  (load-theme 'zenburn t))
    #+end_src
** FONTS
   #+begin_src emacs-lisp
(set-face-attribute 'default nil
		    :family "Monospace" :height 120)
(set-face-attribute 'variable-pitch nil
		    :family "Sans" :height 120)
(global-font-lock-mode 1)
   #+end_src
** VISUAL
   #+begin_src emacs-lisp
(defalias 'yes-or-no-p 'y-or-n-p)
(setq-default truncate-lines 1
	      cursor-in-non-selected-windows nil)
(setq echo-keystrokes 0.1
      scroll-step 1
      frame-resize-pixelwise t
      mouse-wheel-scroll-amount '(1 ((shift) . 1))
      mouse-wheel-progressive-speed nil
      visible-bell t
      blink-matching-paren t
      show-paren-delay 0
      show-paren-style 'expression
      truncate-partial-width-windows 1
      frame-title-format "EMACS"
      icon-title-format frame-title-format)
(show-paren-mode t)
(blink-cursor-mode -1)
(column-number-mode 1)
(global-hl-line-mode 1)
(toggle-indicate-empty-lines 1)
(diminish 'visual-line-mode)
(global-set-key (kbd "C-+") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)

   #+end_src
* BEHAVIOR
** MY FUNCTIONS
   #+begin_src emacs-lisp
(defun glen/toggle-comments ()
  "Toggle comments on line or region"
  (interactive)
  (let (beg end)
    (if (region-active-p)
	(setq beg (region-beginning) end (region-end))
      (setq beg (line-beginning-position) end (line-end-position)))
    (comment-or-uncomment-region beg end)))
(defun glen/org-capture-prompt (prompt variable)
  "PROMPT for string, save it to VARIABLE and insert it."
  (make-local-variable variable)
  (read-string (concat prompt ": ") nil))
   #+end_src
