config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-09-04 Mon 19:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="WALID LAARAKI" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9ac129d">1. INFORMATION</a></li>
<li><a href="#org392a021">2. INTERFACE</a>
<ul>
<li><a href="#org2c03250">2.1. THEMES</a>
<ul>
<li><a href="#orge8eadf5">2.1.1. ZENBURN</a></li>
</ul>
</li>
<li><a href="#org6edc88e">2.2. FONTS</a></li>
<li><a href="#org8469753">2.3. VISUAL</a></li>
</ul>
</li>
<li><a href="#org84a2f84">3. BEHAVIOR</a>
<ul>
<li><a href="#orgdd9503b">3.1. MY FUNCTIONS</a></li>
<li><a href="#org2443950">3.2. GENERAL</a></li>
<li><a href="#orgd9bb5e9">3.3. GLOBAL KEY BINDINGS</a></li>
</ul>
</li>
<li><a href="#org86036d3">4. PACKAGES</a>
<ul>
<li><a href="#org2bbaffd">4.1. GNU</a>
<ul>
<li><a href="#orgf3bf4c9">4.1.1. DIRED</a></li>
<li><a href="#orgd4944bb">4.1.2. TRAMP</a></li>
<li><a href="#org4d60a94">4.1.3. IBUFFER</a></li>
<li><a href="#org140fd8b">4.1.4. ISPELL</a></li>
<li><a href="#org1763aed">4.1.5. FLYSPELL</a></li>
<li><a href="#org9cdc047">4.1.6. ESHELL</a></li>
<li><a href="#orgfa24401">4.1.7. ELDOC</a></li>
<li><a href="#org8fe59eb">4.1.8. GNUS</a></li>
<li><a href="#org511b620">4.1.9. MAGIT</a></li>
<li><a href="#org382cdd8">4.1.10. COFFEE-SCRIPT</a></li>
<li><a href="#org11b2910">4.1.11. <span class="todo INPROGRESS">INPROGRESS</span> ORG-MODE</a></li>
<li><a href="#org65de68e">4.1.12. <span class="todo TODO">TODO</span> RAINBOW-MODE</a></li>
<li><a href="#orge4889a4">4.1.13. <span class="todo TODO">TODO</span> HELM</a></li>
<li><a href="#org34639c4">4.1.14. <span class="todo TODO">TODO</span> BACON</a></li>
<li><a href="#orgc1a2497">4.1.15. <span class="todo TODO">TODO</span> UNDOOTREE</a></li>
<li><a href="#orgcf8557a">4.1.16. <span class="todo TODO">TODO</span> RAINBOW-DELIMITERS</a></li>
<li><a href="#org3e6eab5">4.1.17. <span class="todo TODO">TODO</span> EMMS</a></li>
<li><a href="#org0dd67f0">4.1.18. PHP</a></li>
<li><a href="#orgffc9f10">4.1.19. RESTCLIENT</a></li>
<li><a href="#orgbe390d5">4.1.20. <span class="todo INPROGRESS">INPROGRESS</span> WEB</a></li>
<li><a href="#org3e7da32">4.1.21. <span class="todo INPROGRESS">INPROGRESS</span> COMPANY</a></li>
<li><a href="#org73c87d7">4.1.22. JS</a></li>
<li><a href="#org181746f">4.1.23. ERC</a></li>
<li><a href="#org77dc067">4.1.24. SKEWER MODE</a></li>
<li><a href="#orgd8f1b7e">4.1.25. IMPATIENT MODE</a></li>
<li><a href="#org1ebdecb">4.1.26. IVY</a></li>
<li><a href="#org3e98d90">4.1.27. COUNSEL</a></li>
<li><a href="#org27e1771">4.1.28. AVY</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9ac129d" class="outline-2">
<h2 id="org9ac129d"><span class="section-number-2">1</span> INFORMATION</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> user-full-name <span style="color: #CC9393;">"WALID LAARAKI"</span>
      user-mail-address <span style="color: #CC9393;">"wlaaraki@gmail.com"</span>
      user-home-directory <span style="color: #BFEBBF;">(</span>concat <span style="color: #D0BF8F;">(</span>getenv <span style="color: #CC9393;">"HOME"</span><span style="color: #D0BF8F;">)</span><span style="color: #CC9393;">"/"</span><span style="color: #BFEBBF;">)</span>
      user-emacs-directory <span style="color: #BFEBBF;">(</span>concat user-home-directory <span style="color: #CC9393;">".emacs.d/"</span><span style="color: #BFEBBF;">)</span>
      custom-file <span style="color: #BFEBBF;">(</span>expand-file-name <span style="color: #CC9393;">"custom.el"</span> user-emacs-directory<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>load custom-file<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org392a021" class="outline-2">
<h2 id="org392a021"><span class="section-number-2">2</span> INTERFACE</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-org2c03250" class="outline-3">
<h3 id="org2c03250"><span class="section-number-3">2.1</span> THEMES</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-orge8eadf5" class="outline-4">
<h4 id="orge8eadf5"><span class="section-number-4">2.1.1</span> ZENBURN</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">zenburn-theme</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:pin</span> melpa
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #BFEBBF;">(</span>load-theme 'zenburn t<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org6edc88e" class="outline-3">
<h3 id="org6edc88e"><span class="section-number-3">2.2</span> FONTS</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>set-face-attribute 'default nil
                    <span style="color: #DCDCCC; font-weight: bold;">:family</span> <span style="color: #CC9393;">"Monospace"</span> <span style="color: #DCDCCC; font-weight: bold;">:height</span> 120<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>set-face-attribute 'variable-pitch nil
                    <span style="color: #DCDCCC; font-weight: bold;">:family</span> <span style="color: #CC9393;">"Sans"</span> <span style="color: #DCDCCC; font-weight: bold;">:height</span> 120<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>global-font-lock-mode 1<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8469753" class="outline-3">
<h3 id="org8469753"><span class="section-number-3">2.3</span> VISUAL</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defalias</span> '<span style="color: #93E0E3;">yes-or-no-p</span> 'y-or-n-p<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq-default</span> truncate-lines 1
              cursor-in-non-selected-windows nil<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> echo-keystrokes 0.1
      scroll-step 1
      frame-resize-pixelwise t
      mouse-wheel-scroll-amount '<span style="color: #BFEBBF;">(</span>1 <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>shift<span style="color: #93E0E3;">)</span> . 1<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
      mouse-wheel-progressive-speed nil
      visible-bell t
      blink-matching-paren t
      show-paren-delay 0
      show-paren-style 'expression
      truncate-partial-width-windows 1
      frame-title-format <span style="color: #CC9393;">"EMACS"</span>
      icon-title-format frame-title-format<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>show-paren-mode t<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>blink-cursor-mode -1<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>column-number-mode 1<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>global-hl-line-mode 1<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>toggle-indicate-empty-lines 1<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>diminish 'visual-line-mode<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">(</span>kbd <span style="color: #CC9393;">"C-+"</span><span style="color: #BFEBBF;">)</span> 'text-scale-increase<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">(</span>kbd <span style="color: #CC9393;">"C--"</span><span style="color: #BFEBBF;">)</span> 'text-scale-decrease<span style="color: #DCDCCC;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org84a2f84" class="outline-2">
<h2 id="org84a2f84"><span class="section-number-2">3</span> BEHAVIOR</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgdd9503b" class="outline-3">
<h3 id="orgdd9503b"><span class="section-number-3">3.1</span> MY FUNCTIONS</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">glen/toggle-comments</span> <span style="color: #BFEBBF;">()</span>
  <span style="color: #9FC59F;">"Toggle comments on line or region"</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">interactive</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #D0BF8F;">(</span>beg end<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #93E0E3;">(</span>region-active-p<span style="color: #93E0E3;">)</span>
        <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> beg <span style="color: #9FC59F;">(</span>region-beginning<span style="color: #9FC59F;">)</span> end <span style="color: #9FC59F;">(</span>region-end<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> beg <span style="color: #9FC59F;">(</span>line-beginning-position<span style="color: #9FC59F;">)</span> end <span style="color: #9FC59F;">(</span>line-end-position<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>comment-or-uncomment-region beg end<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">glen/org-capture-prompt</span> <span style="color: #BFEBBF;">(</span>prompt variable<span style="color: #BFEBBF;">)</span>
  <span style="color: #9FC59F;">"PROMPT for string, save it to VARIABLE and insert it."</span>
  <span style="color: #BFEBBF;">(</span>make-local-variable variable<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>read-string <span style="color: #D0BF8F;">(</span>concat prompt <span style="color: #CC9393;">": "</span><span style="color: #D0BF8F;">)</span> nil<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
