config.org
** GENERAL
   #+begin_src emacs-lisp
(setq grep-command "grep -nHor --exclude-dir={assets,*\bower_components,\*node_modules} ctrl "
      backup-directory-alist '(("." . "~/.emacs.d/backups"))
      delete-old-versions -1
      version-control t
      vc-make-backup-files t
      auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t))
      savehist-file "~/.emacs.d/savehist"
      history-length t
      history-delete-duplicates t
      savehist-additional-variables '(kill-ring search-ring regexp-search-ring)
      locale-coding-system 'utf-8
      indent-tabs-mode nil
      sentence-end-double-space nil)
(savehist-mode 1)
(icomplete-mode -1)
(electric-pair-mode 1)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
(delete-selection-mode t)
(global-auto-revert-mode t)
   #+end_src
** GLOBAL KEY BINDINGS
   #+begin_src emacs-lisp
;; ORG
(global-set-key (kbd "C-c c") 'org-capture)
(global-set-key (kbd "C-c a") 'org-agenda)
(global-set-key (kbd "C-c b") 'org-iswitchb)
;; ESHELL
(global-set-key (kbd "C-x m") 'eshell)
(global-set-key (kbd "C-x M") (lambda () (interactive) (eshell t)))
;; IBUFFER
(global-set-key (kbd "C-x C-b") 'ibuffer)
   #+end_src
* PACKAGES
** GNU
*** DIRED
    #+begin_src emacs-lisp
(setq trash-directory (concat user-home-directory "trash")
      delete-by-moving-to-trash t
      dired-listing-switches "-aFlGXh1v --group-directories-first"
      global-auto-revert-non-file-buffers t
      auto-revert-verbose nil)
(add-hook 'dired-mode-hook (lambda () (visual-line-mode -1)))
    #+end_src
*** TRAMP
    #+begin_src emacs-lisp
(set-default 'tramp-default-proxies-alist (quote ((".*" "\\`root\\'" "/ssh:%h:"))))
    #+end_src
