config.html
<div id="outline-container-org2443950" class="outline-3">
<h3 id="org2443950"><span class="section-number-3">3.2</span> GENERAL</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> grep-command <span style="color: #CC9393;">"grep -nHor --exclude-dir={assets,*\bower_components,</span><span style="color: #D0BF8F; font-weight: bold;">\</span><span style="color: #CC9393;">*node_modules} ctrl "</span>
      backup-directory-alist '<span style="color: #BFEBBF;">(</span><span style="color: #D0BF8F;">(</span><span style="color: #CC9393;">"."</span> . <span style="color: #CC9393;">"~/.emacs.d/backups"</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
      delete-old-versions -1
      version-control t
      vc-make-backup-files t
      auto-save-file-name-transforms '<span style="color: #BFEBBF;">(</span><span style="color: #D0BF8F;">(</span><span style="color: #CC9393;">".*"</span> <span style="color: #CC9393;">"~/.emacs.d/auto-save-list/"</span> t<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
      savehist-file <span style="color: #CC9393;">"~/.emacs.d/savehist"</span>
      history-length t
      history-delete-duplicates t
      savehist-additional-variables '<span style="color: #BFEBBF;">(</span>kill-ring search-ring regexp-search-ring<span style="color: #BFEBBF;">)</span>
      locale-coding-system 'utf-8
      indent-tabs-mode nil
      sentence-end-double-space nil<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>savehist-mode 1<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>icomplete-mode -1<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>electric-pair-mode 1<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>set-terminal-coding-system 'utf-8<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>set-keyboard-coding-system 'utf-8<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>set-selection-coding-system 'utf-8<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>prefer-coding-system 'utf-8<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>delete-selection-mode t<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>global-auto-revert-mode t<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd9bb5e9" class="outline-3">
<h3 id="orgd9bb5e9"><span class="section-number-3">3.3</span> GLOBAL KEY BINDINGS</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">ORG</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">(</span>kbd <span style="color: #CC9393;">"C-c c"</span><span style="color: #BFEBBF;">)</span> 'org-capture<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">(</span>kbd <span style="color: #CC9393;">"C-c a"</span><span style="color: #BFEBBF;">)</span> 'org-agenda<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">(</span>kbd <span style="color: #CC9393;">"C-c b"</span><span style="color: #BFEBBF;">)</span> 'org-iswitchb<span style="color: #DCDCCC;">)</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">ESHELL</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">(</span>kbd <span style="color: #CC9393;">"C-x m"</span><span style="color: #BFEBBF;">)</span> 'eshell<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">(</span>kbd <span style="color: #CC9393;">"C-x M"</span><span style="color: #BFEBBF;">)</span> <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #D0BF8F;">()</span> <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">interactive</span><span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>eshell t<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">IBUFFER</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">(</span>kbd <span style="color: #CC9393;">"C-x C-b"</span><span style="color: #BFEBBF;">)</span> 'ibuffer<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org86036d3" class="outline-2">
<h2 id="org86036d3"><span class="section-number-2">4</span> PACKAGES</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-org2bbaffd" class="outline-3">
<h3 id="org2bbaffd"><span class="section-number-3">4.1</span> GNU</h3>
<div class="outline-text-3" id="text-4-1">
</div><div id="outline-container-orgf3bf4c9" class="outline-4">
<h4 id="orgf3bf4c9"><span class="section-number-4">4.1.1</span> DIRED</h4>
<div class="outline-text-4" id="text-4-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> trash-directory <span style="color: #BFEBBF;">(</span>concat user-home-directory <span style="color: #CC9393;">"trash"</span><span style="color: #BFEBBF;">)</span>
      delete-by-moving-to-trash t
      dired-listing-switches <span style="color: #CC9393;">"-aFlGXh1v --group-directories-first"</span>
      global-auto-revert-non-file-buffers t
      auto-revert-verbose nil<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>add-hook 'dired-mode-hook <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #D0BF8F;">()</span> <span style="color: #D0BF8F;">(</span>visual-line-mode -1<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd4944bb" class="outline-4">
<h4 id="orgd4944bb"><span class="section-number-4">4.1.2</span> TRAMP</h4>
<div class="outline-text-4" id="text-4-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>set-default 'tramp-default-proxies-alist <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">quote</span> <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span><span style="color: #CC9393;">".*"</span> <span style="color: #CC9393;">"\</span><span style="color: #D0BF8F; font-weight: bold;">\</span><span style="color: #CC9393;">`</span><span style="color: #BFEBBF;">root\</span><span style="color: #BFEBBF; font-weight: bold;">\</span><span style="color: #CC9393;">'"</span> <span style="color: #CC9393;">"/ssh:%h:"</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
