config.org
*** IBUFFER
    #+begin_src emacs-lisp
(setq ibuffer-default-sorting-mode 'major-mode
      ibuffer-movement-cycle nil
      ibuffer-never-show-predicates '("^\\*helm")
      savehist-save-minibuffer-history 1
      ibuffer-show-empty-filter-groups nil
      ibuffer-saved-filter-groups
      (quote (("default"
	       ("dired" (mode . dired-mode))
	       ("web" (or
		       (mode . js2-mode)
		       (mode . restclient-mode)
		       (mode . web-mode)
		       (mode . php-mode)
		       (mode . css-mode)))
	       ("erc" (mode . erc-mode))
	       ("org" (mode . org-mode))
	       ("images" (mode . image-mode))
	       ("help" (or
			(name . "^\\*Help\\*$")
			(name . "^\\*Apropos\\*$")
			(name . "^\\*info\\*$")))
	       ("emacs" (or
			 (name . "^\\*Edit Macro\\*$")
			 (name . "^\\*scratch\\*$")
			 (name . "^\\*Messages\\*$")))
	       ("gnus" (or
			(mode . message-mode)
			(mode . bbdb-mode)
			(mode . mail-mode)
			(mode . gnus-group-mode)
			(mode . gnus-summary-mode)
			(mode . gnus-article-mode)
			(name . "^\\.bbdb$")
			(name . "^\\.newsrc-dribble")))))))
(add-hook 'ibuffer-mode-hook
	  (lambda ()
	    (ibuffer-auto-mode 1)
	    (ibuffer-switch-to-saved-filter-groups "default")))
    #+end_src
*** ISPELL
    #+begin_src emacs-lisp
(use-package ispell
  :if (not (bound-and-true-p disable-pkg-ispell))
  :defer t
  :config
  (progn
    (when (executable-find "aspell")
      (setq ispell-program-name "aspell"
	    ispell-extra-args '("--sug-mode=ultra" "--lang=en_US")
	    ispell-silently-savep t))))
    #+end_src
*** FLYSPELL
    #+begin_src emacs-lisp
(use-package flyspell
  :diminish flyspell-mode
  :init
  (progn
    (add-hook 'prog-mode-hook 'flyspell-prog-mode)
    (add-hook 'text-mode-hook 'turn-on-flyspell)
    (add-hook 'org-mode-hook  'turn-on-flyspell))
  :config
  (progn
    (setq flyspell-use-meta-tab nil
	  flyspell-auto-correct-binding (kbd "C-x a c"))))
    #+end_src
*** ESHELL
    #+begin_src emacs-lisp
(add-hook 'eshell-mode-hook (lambda () (setenv "PAGER" "cat") (setenv "EDITOR" "emacsclient")))
    #+end_src
*** ELDOC
    #+begin_src emacs-lisp
(use-package eldoc
  :diminish eldoc-mode
  :commands turn-on-eldoc-mode
  :init
  (progn
    (add-hook 'emacs-lisp-mode-hook 'eldoc-mode)
    (add-hook 'lisp-interaction-mode-hook 'eldoc-mode)
    (add-hook 'ielm-mode-hook 'eldoc-mode)))
    #+end_src
