config.html
<div id="outline-container-org4d60a94" class="outline-4">
<h4 id="org4d60a94"><span class="section-number-4">4.1.3</span> IBUFFER</h4>
<div class="outline-text-4" id="text-4-1-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> ibuffer-default-sorting-mode 'major-mode
      ibuffer-movement-cycle nil
      ibuffer-never-show-predicates '<span style="color: #BFEBBF;">(</span><span style="color: #CC9393;">"^\</span><span style="color: #D0BF8F; font-weight: bold;">\</span><span style="color: #CC9393;">*helm"</span><span style="color: #BFEBBF;">)</span>
      savehist-save-minibuffer-history 1
      ibuffer-show-empty-filter-groups nil
      ibuffer-saved-filter-groups
      <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">quote</span> <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span><span style="color: #CC9393;">"default"</span>
               <span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"dired"</span> <span style="color: #94BFF3;">(</span>mode . dired-mode<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
               <span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"web"</span> <span style="color: #94BFF3;">(</span><span style="color: #F0DFAF; font-weight: bold;">or</span>
                       <span style="color: #E0CF9F;">(</span>mode . js2-mode<span style="color: #E0CF9F;">)</span>
                       <span style="color: #E0CF9F;">(</span>mode . restclient-mode<span style="color: #E0CF9F;">)</span>
                       <span style="color: #E0CF9F;">(</span>mode . web-mode<span style="color: #E0CF9F;">)</span>
                       <span style="color: #E0CF9F;">(</span>mode . php-mode<span style="color: #E0CF9F;">)</span>
                       <span style="color: #E0CF9F;">(</span>mode . css-mode<span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
               <span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"erc"</span> <span style="color: #94BFF3;">(</span>mode . erc-mode<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
               <span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"org"</span> <span style="color: #94BFF3;">(</span>mode . org-mode<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
               <span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"images"</span> <span style="color: #94BFF3;">(</span>mode . image-mode<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
               <span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"help"</span> <span style="color: #94BFF3;">(</span><span style="color: #F0DFAF; font-weight: bold;">or</span>
                        <span style="color: #E0CF9F;">(</span>name . <span style="color: #CC9393;">"^\</span><span style="color: #D0BF8F; font-weight: bold;">\</span><span style="color: #CC9393;">*Help\</span><span style="color: #D0BF8F; font-weight: bold;">\</span><span style="color: #CC9393;">*$"</span><span style="color: #E0CF9F;">)</span>
                        <span style="color: #E0CF9F;">(</span>name . <span style="color: #CC9393;">"^\</span><span style="color: #D0BF8F; font-weight: bold;">\</span><span style="color: #CC9393;">*Apropos\</span><span style="color: #D0BF8F; font-weight: bold;">\</span><span style="color: #CC9393;">*$"</span><span style="color: #E0CF9F;">)</span>
                        <span style="color: #E0CF9F;">(</span>name . <span style="color: #CC9393;">"^\</span><span style="color: #D0BF8F; font-weight: bold;">\</span><span style="color: #CC9393;">*info\</span><span style="color: #D0BF8F; font-weight: bold;">\</span><span style="color: #CC9393;">*$"</span><span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
               <span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"emacs"</span> <span style="color: #94BFF3;">(</span><span style="color: #F0DFAF; font-weight: bold;">or</span>
                         <span style="color: #E0CF9F;">(</span>name . <span style="color: #CC9393;">"^\</span><span style="color: #D0BF8F; font-weight: bold;">\</span><span style="color: #CC9393;">*Edit Macro\</span><span style="color: #D0BF8F; font-weight: bold;">\</span><span style="color: #CC9393;">*$"</span><span style="color: #E0CF9F;">)</span>
                         <span style="color: #E0CF9F;">(</span>name . <span style="color: #CC9393;">"^\</span><span style="color: #D0BF8F; font-weight: bold;">\</span><span style="color: #CC9393;">*scratch\</span><span style="color: #D0BF8F; font-weight: bold;">\</span><span style="color: #CC9393;">*$"</span><span style="color: #E0CF9F;">)</span>
                         <span style="color: #E0CF9F;">(</span>name . <span style="color: #CC9393;">"^\</span><span style="color: #D0BF8F; font-weight: bold;">\</span><span style="color: #CC9393;">*Messages\</span><span style="color: #D0BF8F; font-weight: bold;">\</span><span style="color: #CC9393;">*$"</span><span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
               <span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"gnus"</span> <span style="color: #94BFF3;">(</span><span style="color: #F0DFAF; font-weight: bold;">or</span>
                        <span style="color: #E0CF9F;">(</span>mode . message-mode<span style="color: #E0CF9F;">)</span>
                        <span style="color: #E0CF9F;">(</span>mode . bbdb-mode<span style="color: #E0CF9F;">)</span>
                        <span style="color: #E0CF9F;">(</span>mode . mail-mode<span style="color: #E0CF9F;">)</span>
                        <span style="color: #E0CF9F;">(</span>mode . gnus-group-mode<span style="color: #E0CF9F;">)</span>
                        <span style="color: #E0CF9F;">(</span>mode . gnus-summary-mode<span style="color: #E0CF9F;">)</span>
                        <span style="color: #E0CF9F;">(</span>mode . gnus-article-mode<span style="color: #E0CF9F;">)</span>
                        <span style="color: #E0CF9F;">(</span>name . <span style="color: #CC9393;">"^\</span><span style="color: #D0BF8F; font-weight: bold;">\</span><span style="color: #CC9393;">.bbdb$"</span><span style="color: #E0CF9F;">)</span>
                        <span style="color: #E0CF9F;">(</span>name . <span style="color: #CC9393;">"^\</span><span style="color: #D0BF8F; font-weight: bold;">\</span><span style="color: #CC9393;">.newsrc-dribble"</span><span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>add-hook 'ibuffer-mode-hook
          <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #D0BF8F;">()</span>
            <span style="color: #D0BF8F;">(</span>ibuffer-auto-mode 1<span style="color: #D0BF8F;">)</span>
            <span style="color: #D0BF8F;">(</span>ibuffer-switch-to-saved-filter-groups <span style="color: #CC9393;">"default"</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org140fd8b" class="outline-4">
<h4 id="org140fd8b"><span class="section-number-4">4.1.4</span> ISPELL</h4>
<div class="outline-text-4" id="text-4-1-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">ispell</span>
  <span style="color: #DCDCCC; font-weight: bold;">:if</span> <span style="color: #BFEBBF;">(</span>not <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">bound-and-true-p</span> disable-pkg-ispell<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:defer</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #93E0E3;">(</span>executable-find <span style="color: #CC9393;">"aspell"</span><span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> ispell-program-name <span style="color: #CC9393;">"aspell"</span>
            ispell-extra-args '<span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"--sug-mode=ultra"</span> <span style="color: #CC9393;">"--lang=en_US"</span><span style="color: #9FC59F;">)</span>
            ispell-silently-savep t<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1763aed" class="outline-4">
<h4 id="org1763aed"><span class="section-number-4">4.1.5</span> FLYSPELL</h4>
<div class="outline-text-4" id="text-4-1-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">flyspell</span>
  <span style="color: #DCDCCC; font-weight: bold;">:diminish</span> flyspell-mode
  <span style="color: #DCDCCC; font-weight: bold;">:init</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
    <span style="color: #D0BF8F;">(</span>add-hook 'prog-mode-hook 'flyspell-prog-mode<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>add-hook 'text-mode-hook 'turn-on-flyspell<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>add-hook 'org-mode-hook  'turn-on-flyspell<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> flyspell-use-meta-tab nil
          flyspell-auto-correct-binding <span style="color: #93E0E3;">(</span>kbd <span style="color: #CC9393;">"C-x a c"</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9cdc047" class="outline-4">
<h4 id="org9cdc047"><span class="section-number-4">4.1.6</span> ESHELL</h4>
<div class="outline-text-4" id="text-4-1-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>add-hook 'eshell-mode-hook <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #D0BF8F;">()</span> <span style="color: #D0BF8F;">(</span>setenv <span style="color: #CC9393;">"PAGER"</span> <span style="color: #CC9393;">"cat"</span><span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>setenv <span style="color: #CC9393;">"EDITOR"</span> <span style="color: #CC9393;">"emacsclient"</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfa24401" class="outline-4">
<h4 id="orgfa24401"><span class="section-number-4">4.1.7</span> ELDOC</h4>
<div class="outline-text-4" id="text-4-1-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">eldoc</span>
  <span style="color: #DCDCCC; font-weight: bold;">:diminish</span> eldoc-mode
  <span style="color: #DCDCCC; font-weight: bold;">:commands</span> turn-on-eldoc-mode
  <span style="color: #DCDCCC; font-weight: bold;">:init</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
    <span style="color: #D0BF8F;">(</span>add-hook 'emacs-lisp-mode-hook 'eldoc-mode<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>add-hook 'lisp-interaction-mode-hook 'eldoc-mode<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>add-hook 'ielm-mode-hook 'eldoc-mode<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
