config.org
*** GNUS
    #+begin_src emacs-lisp
(setq gnus-select-method '(nnimap "gmail"
				  (nnimap-address "imap.gmail.com")
				  (nnimap-server-port "imaps")
				  (nnimap-stream ssl))
      gnus-secondary-select-methods '((nnimap "id2tel"
					      (nnimap-address "imap.gmail.com")
					      (nnimap-server-port "imaps")
					      (nnimap-stream ssl)))
      mm-discouraged-alternatives '("text/richtext")
      mm-text-html-renderer 'gnus-w3m)
(setq smtpmail-default-smtp-server "smtp.gmail.com"
      smtpmail-smtp-server "smtp.gmail.com"
      smtpmail-stream-type  'ssl
      smtpmail-smtp-service 465
      send-mail-function 'smtpmail-send-it
      message-send-mail-function 'smtpmail-send-it)
    #+end_src
*** MAGIT
    #+begin_src emacs-lisp
     (global-set-key (kbd "C-x g") 'magit-status)
    #+end_src
*** COFFEE-SCRIPT
   #+begin_src emacs-lisp
(use-package coffee-mode
   :ensure t
   :init
   (progn
     (add-hook 'coffee-mode-hook (lambda ()
				   (setq coffee-tab-width 2)))))
   #+end_src
