config.html
<div id="outline-container-org8fe59eb" class="outline-4">
<h4 id="org8fe59eb"><span class="section-number-4">4.1.8</span> GNUS</h4>
<div class="outline-text-4" id="text-4-1-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> gnus-select-method '<span style="color: #BFEBBF;">(</span>nnimap <span style="color: #CC9393;">"gmail"</span>
                                  <span style="color: #D0BF8F;">(</span>nnimap-address <span style="color: #CC9393;">"imap.gmail.com"</span><span style="color: #D0BF8F;">)</span>
                                  <span style="color: #D0BF8F;">(</span>nnimap-server-port <span style="color: #CC9393;">"imaps"</span><span style="color: #D0BF8F;">)</span>
                                  <span style="color: #D0BF8F;">(</span>nnimap-stream ssl<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
      gnus-secondary-select-methods '<span style="color: #BFEBBF;">(</span><span style="color: #D0BF8F;">(</span>nnimap <span style="color: #CC9393;">"id2tel"</span>
                                              <span style="color: #93E0E3;">(</span>nnimap-address <span style="color: #CC9393;">"imap.gmail.com"</span><span style="color: #93E0E3;">)</span>
                                              <span style="color: #93E0E3;">(</span>nnimap-server-port <span style="color: #CC9393;">"imaps"</span><span style="color: #93E0E3;">)</span>
                                              <span style="color: #93E0E3;">(</span>nnimap-stream ssl<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
      mm-discouraged-alternatives '<span style="color: #BFEBBF;">(</span><span style="color: #CC9393;">"text/richtext"</span><span style="color: #BFEBBF;">)</span>
      mm-text-html-renderer 'gnus-w3m<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> smtpmail-default-smtp-server <span style="color: #CC9393;">"smtp.gmail.com"</span>
      smtpmail-smtp-server <span style="color: #CC9393;">"smtp.gmail.com"</span>
      smtpmail-stream-type  'ssl
      smtpmail-smtp-service 465
      send-mail-function 'smtpmail-send-it
      message-send-mail-function 'smtpmail-send-it<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org511b620" class="outline-4">
<h4 id="org511b620"><span class="section-number-4">4.1.9</span> MAGIT</h4>
<div class="outline-text-4" id="text-4-1-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">     <span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">(</span>kbd <span style="color: #CC9393;">"C-x g"</span><span style="color: #BFEBBF;">)</span> 'magit-status<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org382cdd8" class="outline-4">
<h4 id="org382cdd8"><span class="section-number-4">4.1.10</span> COFFEE-SCRIPT</h4>
<div class="outline-text-4" id="text-4-1-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">coffee-mode</span>
   <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
   <span style="color: #DCDCCC; font-weight: bold;">:init</span>
   <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
     <span style="color: #D0BF8F;">(</span>add-hook 'coffee-mode-hook <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #9FC59F;">()</span>
                                   <span style="color: #9FC59F;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> coffee-tab-width 2<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
