config.org
*** INPROGRESS ORG-MODE
    #+begin_src emacs-lisp
(use-package org-plus-contrib
  :ensure t
  :pin org
  :mode (("\\.org$" . org-mode))
  :preface
  (progn
    (unless (package-installed-p 'bbdb)
      (package-install 'bbdb)
      (package-install 'bbdb-vcard)
      (package-install 'gnuplot))
    (setq bbdb-file "~/document/contacts"
	  bbdb-north-american-phone-numbers-p nil
	  org-directory "~/documents/org"
	  glen/org-expenses-file (concat org-directory "/expenses.org")
	  glen/org-note-file (concat org-directory "/notes/" (format-time-string "%Y") "/" (format-time-string "%U") ".org")
	  glen/org-todo-file (concat org-directory "/refile.org")
	  glen/org-weight-file (concat org-directory "/weight/weight.org")))
  :init
  (progn
    (setq org-modules '(org-bbdb)
	  org-src-fontify-natively t
	  org-src-window-setup 'current-window
	  org-src-strip-leading-and-trailing-blank-lines t
	  org-src-preserve-indentation t
	  org-src-tab-acts-natively t
	  org-agenda-include-diary nil
	  org-use-speed-commands t
	  org-use-fast-todo-selection t
	  org-agenda-start-on-weekday 7
	  org-tags-column 45
	  org-agenda-files '("~/documents/org/agenda"
			     "~/documents/org/agenda/home"
			     "~/documents/org/agenda/work")
	  org-refile-targets '((nil :maxlevel . 9) (org-agenda-files :maxlevel . 9))
	  org-tag-alist '(("home" . ?h)
			  ("work" . ?w)
			  ("note" . ?n)
			  ("transport" . ?t)
			  ("food" . ?f)
			  ("clothes" . ?c)
			  ("medicine" . ?m)
			  ("grooming" . ?g)
			  ("entertainment" . ?e))
	  org-todo-keywords '((sequence "SOMEDAY(s)" "TODO(t)" "INPROGRESS(i)" "DONE(d)" "WAITING(w)" "CANCELED(c)"))
	  org-todo-keyword-faces '(("SOMEDAY" :foreground "#6CA0A3" :weight bold :height 0.8)
				   ("TODO" :foreground "#AC7373" :weight bold :height 0.8)
				   ("INPROGRESS" :foreground "#DFAF8F" :weight bold :height 0.8)
				   ("DONE" :foreground "#5F7F5F" :weight bold :height 0.8)
				   ("WAITING" :foreground "white" :weight bold :height 0.8)
				   ("CANCELED" :foreground "#4F4F4F" :weight bold :height 0.8))
	  org-capture-templates '(("e" "EXPENSES" entry (file+weektree glen/org-expenses-file) "* %(glen/org-capture-prompt \"ITEM\" 'item)\n:PROPERTIES:\n:PRICE: %(glen/org-capture-prompt \"PRICE\" 'item)\n:END:" :kill-buffer t)
				  ("t" "TODO" entry (file glen/org-todo-file) "* TODO %? \n%U")
				  ("n" "NOTE" entry (file glen/org-note-file) "* %? :@note: \n%U")
				  ("w" "WEIGHT" plain (file+weektree glen/org-weight-file) ":PROPERTIES:\n:WEIGHT: %?\n:END:" :kill-buffer t)))
    (add-hook 'org-capture-before-finalize-hook (lambda ()
						  (if (org-at-heading-p)
						      (org-set-tags))))
    (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))))
    #+end_src
