config.html
<div id="outline-container-org11b2910" class="outline-4">
<h4 id="org11b2910"><span class="section-number-4">4.1.11</span> <span class="todo INPROGRESS">INPROGRESS</span> ORG-MODE</h4>
<div class="outline-text-4" id="text-4-1-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">org-plus-contrib</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:pin</span> org
  <span style="color: #DCDCCC; font-weight: bold;">:mode</span> <span style="color: #BFEBBF;">(</span><span style="color: #D0BF8F;">(</span><span style="color: #CC9393;">"\</span><span style="color: #D0BF8F; font-weight: bold;">\</span><span style="color: #CC9393;">.org$"</span> . org-mode<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:preface</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">unless</span> <span style="color: #93E0E3;">(</span>package-installed-p 'bbdb<span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span>package-install 'bbdb<span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span>package-install 'bbdb-vcard<span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span>package-install 'gnuplot<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> bbdb-file <span style="color: #CC9393;">"~/document/contacts"</span>
          bbdb-north-american-phone-numbers-p nil
          org-directory <span style="color: #CC9393;">"~/documents/org"</span>
          glen/org-expenses-file <span style="color: #93E0E3;">(</span>concat org-directory <span style="color: #CC9393;">"/expenses.org"</span><span style="color: #93E0E3;">)</span>
          glen/org-note-file <span style="color: #93E0E3;">(</span>concat org-directory <span style="color: #CC9393;">"/notes/"</span> <span style="color: #9FC59F;">(</span>format-time-string <span style="color: #CC9393;">"%Y"</span><span style="color: #9FC59F;">)</span> <span style="color: #CC9393;">"/"</span> <span style="color: #9FC59F;">(</span>format-time-string <span style="color: #CC9393;">"%U"</span><span style="color: #9FC59F;">)</span> <span style="color: #CC9393;">".org"</span><span style="color: #93E0E3;">)</span>
          glen/org-todo-file <span style="color: #93E0E3;">(</span>concat org-directory <span style="color: #CC9393;">"/refile.org"</span><span style="color: #93E0E3;">)</span>
          glen/org-weight-file <span style="color: #93E0E3;">(</span>concat org-directory <span style="color: #CC9393;">"/weight/weight.org"</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:init</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> org-modules '<span style="color: #93E0E3;">(</span>org-bbdb<span style="color: #93E0E3;">)</span>
          org-src-fontify-natively t
          org-src-window-setup 'current-window
          org-src-strip-leading-and-trailing-blank-lines t
          org-src-preserve-indentation t
          org-src-tab-acts-natively t
          org-agenda-include-diary nil
          org-use-speed-commands t
          org-use-fast-todo-selection t
          org-agenda-start-on-weekday 7
          org-tags-column 45
          org-agenda-files '<span style="color: #93E0E3;">(</span><span style="color: #CC9393;">"~/documents/org/agenda"</span>
                             <span style="color: #CC9393;">"~/documents/org/agenda/home"</span>
                             <span style="color: #CC9393;">"~/documents/org/agenda/work"</span><span style="color: #93E0E3;">)</span>
          org-refile-targets '<span style="color: #93E0E3;">(</span><span style="color: #9FC59F;">(</span>nil <span style="color: #DCDCCC; font-weight: bold;">:maxlevel</span> . 9<span style="color: #9FC59F;">)</span> <span style="color: #9FC59F;">(</span>org-agenda-files <span style="color: #DCDCCC; font-weight: bold;">:maxlevel</span> . 9<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
          org-tag-alist '<span style="color: #93E0E3;">(</span><span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"home"</span> . ?h<span style="color: #9FC59F;">)</span>
                          <span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"work"</span> . ?w<span style="color: #9FC59F;">)</span>
                          <span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"note"</span> . ?n<span style="color: #9FC59F;">)</span>
                          <span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"transport"</span> . ?t<span style="color: #9FC59F;">)</span>
                          <span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"food"</span> . ?f<span style="color: #9FC59F;">)</span>
                          <span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"clothes"</span> . ?c<span style="color: #9FC59F;">)</span>
                          <span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"medicine"</span> . ?m<span style="color: #9FC59F;">)</span>
                          <span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"grooming"</span> . ?g<span style="color: #9FC59F;">)</span>
                          <span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"entertainment"</span> . ?e<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
          org-todo-keywords '<span style="color: #93E0E3;">(</span><span style="color: #9FC59F;">(</span>sequence <span style="color: #CC9393;">"SOMEDAY(s)"</span> <span style="color: #CC9393;">"TODO(t)"</span> <span style="color: #CC9393;">"INPROGRESS(i)"</span> <span style="color: #CC9393;">"DONE(d)"</span> <span style="color: #CC9393;">"WAITING(w)"</span> <span style="color: #CC9393;">"CANCELED(c)"</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
          org-todo-keyword-faces '<span style="color: #93E0E3;">(</span><span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"SOMEDAY"</span> <span style="color: #DCDCCC; font-weight: bold;">:foreground</span> <span style="color: #CC9393;">"</span><span style="color: #000000; background-color: #6CA0A3;">#6CA0A3</span><span style="color: #CC9393;">"</span> <span style="color: #DCDCCC; font-weight: bold;">:weight</span> bold <span style="color: #DCDCCC; font-weight: bold;">:height</span> 0.8<span style="color: #9FC59F;">)</span>
                                   <span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"TODO"</span> <span style="color: #DCDCCC; font-weight: bold;">:foreground</span> <span style="color: #CC9393;">"</span><span style="color: #ffffff; background-color: #AC7373;">#AC7373</span><span style="color: #CC9393;">"</span> <span style="color: #DCDCCC; font-weight: bold;">:weight</span> bold <span style="color: #DCDCCC; font-weight: bold;">:height</span> 0.8<span style="color: #9FC59F;">)</span>
                                   <span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"INPROGRESS"</span> <span style="color: #DCDCCC; font-weight: bold;">:foreground</span> <span style="color: #CC9393;">"</span><span style="color: #000000; background-color: #DFAF8F;">#DFAF8F</span><span style="color: #CC9393;">"</span> <span style="color: #DCDCCC; font-weight: bold;">:weight</span> bold <span style="color: #DCDCCC; font-weight: bold;">:height</span> 0.8<span style="color: #9FC59F;">)</span>
                                   <span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"DONE"</span> <span style="color: #DCDCCC; font-weight: bold;">:foreground</span> <span style="color: #CC9393;">"</span><span style="color: #ffffff; background-color: #5F7F5F;">#5F7F5F</span><span style="color: #CC9393;">"</span> <span style="color: #DCDCCC; font-weight: bold;">:weight</span> bold <span style="color: #DCDCCC; font-weight: bold;">:height</span> 0.8<span style="color: #9FC59F;">)</span>
                                   <span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"WAITING"</span> <span style="color: #DCDCCC; font-weight: bold;">:foreground</span> <span style="color: #CC9393;">"</span><span style="color: #000000; background-color: #ffffff;">white</span><span style="color: #CC9393;">"</span> <span style="color: #DCDCCC; font-weight: bold;">:weight</span> bold <span style="color: #DCDCCC; font-weight: bold;">:height</span> 0.8<span style="color: #9FC59F;">)</span>
                                   <span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"CANCELED"</span> <span style="color: #DCDCCC; font-weight: bold;">:foreground</span> <span style="color: #CC9393;">"</span><span style="color: #ffffff; background-color: #4F4F4F;">#4F4F4F</span><span style="color: #CC9393;">"</span> <span style="color: #DCDCCC; font-weight: bold;">:weight</span> bold <span style="color: #DCDCCC; font-weight: bold;">:height</span> 0.8<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
          org-capture-templates '<span style="color: #93E0E3;">(</span><span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"e"</span> <span style="color: #CC9393;">"EXPENSES"</span> entry <span style="color: #94BFF3;">(</span>file+weektree glen/org-expenses-file<span style="color: #94BFF3;">)</span> <span style="color: #CC9393;">"* %(glen/org-capture-prompt \"ITEM\" 'item)\n:PROPERTIES:\n:PRICE: %(glen/org-capture-prompt \"PRICE\" 'item)\n:END:"</span> <span style="color: #DCDCCC; font-weight: bold;">:kill-buffer</span> t<span style="color: #9FC59F;">)</span>
                                  <span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"t"</span> <span style="color: #CC9393;">"TODO"</span> entry <span style="color: #94BFF3;">(</span>file glen/org-todo-file<span style="color: #94BFF3;">)</span> <span style="color: #CC9393;">"* TODO %? \n%U"</span><span style="color: #9FC59F;">)</span>
                                  <span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"n"</span> <span style="color: #CC9393;">"NOTE"</span> entry <span style="color: #94BFF3;">(</span>file glen/org-note-file<span style="color: #94BFF3;">)</span> <span style="color: #CC9393;">"* %? :@note: \n%U"</span><span style="color: #9FC59F;">)</span>
                                  <span style="color: #9FC59F;">(</span><span style="color: #CC9393;">"w"</span> <span style="color: #CC9393;">"WEIGHT"</span> plain <span style="color: #94BFF3;">(</span>file+weektree glen/org-weight-file<span style="color: #94BFF3;">)</span> <span style="color: #CC9393;">":PROPERTIES:\n:WEIGHT: %?\n:END:"</span> <span style="color: #DCDCCC; font-weight: bold;">:kill-buffer</span> t<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>add-hook 'org-capture-before-finalize-hook <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #9FC59F;">()</span>
                                                  <span style="color: #9FC59F;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #94BFF3;">(</span>org-at-heading-p<span style="color: #94BFF3;">)</span>
                                                      <span style="color: #94BFF3;">(</span>org-set-tags<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>add-hook 'org-mode-hook <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #9FC59F;">()</span> <span style="color: #9FC59F;">(</span>org-bullets-mode 1<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
