config.org
*** TODO RAINBOW-MODE
    #+begin_src emacs-lisp
(use-package rainbow-mode
  :pin gnu
  :ensure t
  :diminish 'rainbow-mode
  :config
  (progn
    (add-hook 'prog-mode-hook 'rainbow-mode)
    (add-hook 'help-mode-hook 'rainbow-mode)))
    #+end_src
*** TODO HELM
    #+begin_src emacs-lisp
(use-package helm
  :ensure helm-projectile
  :ensure helm-swoop
  :ensure helm-descbinds
  :diminish helm-mode
  :bind (("M-y" . helm-show-kill-ring)
	 ("M-x" . helm-M-x)
	 ("C-s" . helm-swoop-without-pre-input)
	 ("C-h b" . helm-descbinds)
	 ("C-h a" . helm-apropos)
	 ("C-c p h" . helm-projectile)
	 ("C-x r l" . helm-bookmarks)
	 ("C-x c m" . helm-all-mark-rings)
	 ("C-x c o" . helm-occur)
	 ("C-x c r" . helm-recentf)
	 ("C-x b" . helm-mini)
	 ("C-x C-f" . helm-find-files))
  :config
  (progn
    (helm-projectile-on)
    (helm-autoresize-mode 1)
    (helm-mode)
    (setq helm-locate-command "locate -i -r %s"
	  helm-idle-delay 0.0
          helm-input-idle-delay 0.01
          helm-quick-update t
	  helm-mode-fuzzy-match t
          helm-ff-skip-boring-files t
	  helm-ff-newfile-prompt-p nil
	  helm-ff-fuzzy-match t
          helm-yas-display-key-on-candidate t
	  helm-locate-fuzzy-match t
	  helm-projectile-fuzzy-match t
	  helm-recentf-fuzzy-match t
	  helm-buffers-fuzzy-match t
	  helm-apropos-fuzzy-match t
	  helm-M-x-fuzzy-match t
	  helm-swoop-move-to-line-cycle nil
	  helm-swoop-split-direction 'split-window-vertically
          helm-M-x-requires-pattern nil
	  helm-swoop-use-fuzzy-match t
	  helm-swoop-split-with-multiple-windows nil
	  helm-display-header-line nil)))
    #+end_src
*** TODO BACON
    #+begin_src emacs-lisp
(use-package beacon
  :ensure t
  :diminish beacon-mode
  :config
  (progn
    (beacon-mode 1)
    (setq beacon-blink-when-point-moves-vertically nil
	  beacon-blink-when-point-moves-horizontally nil
	  beacon-blink-when-buffer-changes t
	  beacon-blink-when-window-scrolls t
	  beacon-blink-when-window-changes t
	  beacon-blink-when-focused nil
	  beacon-blink-duration 0.3
	  beacon-blink-delay 0.3
	  beacon-size 20
	  beacon-color 0.5)))
    #+end_src
*** TODO UNDOOTREE
    #+begin_src emacs-lisp
(use-package undo-tree
  :ensure t
  :diminish undo-tree-mode
  :bind (("C-x u" . undo-tree-visualize))
  :commands global-undo-tree-mode
  :config
  (progn
    (setq undo-tree-visualizer-timestamps t
	  undo-tree-visualizer-diff nil)))
    #+end_src
*** TODO RAINBOW-DELIMITERS
    #+begin_src emacs-lisp
(use-package rainbow-delimiters
  :defer t
  :ensure t
  :init
  (add-hook 'prog-mode-hook 'rainbow-delimiters-mode))
    #+end_src
*** TODO EMMS
    #+begin_src emacs-lisp
;; (use-package emms
;;   :ensure t
;;   :pin melpa-stable
;;   :init
;;   (progn
;;     (emms-player-mpd-update-all)
;;     (emms-cache-set-from-mpd-all))
;;   :config
;;   (progn
;;     (setq emms-player-list '(emms-player-mpd)
;; 	  emms-player-mpd-server-name "localhost"
;; 	  emms-player-mpd-server-port "6600"
;; 	  emms-player-mpd-music-directory "~/music"
;; 	  emms-player-mpd-sync-playlist nil
;; 	  emms-playing-time-display-p nil
;; 	  emms-info-functions '(emms-info-mpd)
;; 	  emms-info-asynchronously nil
;; 	  emms-info-auto-update t
;; 	  emms-lyrics-scroll-p nil
;; 	  emms-lyrics-display-on-minibuffer t
;; 	  emms-lyrics-display-on-modeline nil
;; 	  emms-lyrics-dir "~/music/lyrics"
;; 	  emms-browser-default-covers '("~/music/cover_default.jpg" nil nil)
;; 	  emms-browser-default-browse-type 'info-album)))
    #+end_src
