config.html
<div id="outline-container-org65de68e" class="outline-4">
<h4 id="org65de68e"><span class="section-number-4">4.1.12</span> <span class="todo TODO">TODO</span> RAINBOW-MODE</h4>
<div class="outline-text-4" id="text-4-1-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">rainbow-mode</span>
  <span style="color: #DCDCCC; font-weight: bold;">:pin</span> gnu
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:diminish</span> 'rainbow-mode
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
    <span style="color: #D0BF8F;">(</span>add-hook 'prog-mode-hook 'rainbow-mode<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>add-hook 'help-mode-hook 'rainbow-mode<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge4889a4" class="outline-4">
<h4 id="orge4889a4"><span class="section-number-4">4.1.13</span> <span class="todo TODO">TODO</span> HELM</h4>
<div class="outline-text-4" id="text-4-1-13">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">helm</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> helm-projectile
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> helm-swoop
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> helm-descbinds
  <span style="color: #DCDCCC; font-weight: bold;">:diminish</span> helm-mode
  <span style="color: #DCDCCC; font-weight: bold;">:bind</span> <span style="color: #BFEBBF;">(</span><span style="color: #D0BF8F;">(</span><span style="color: #CC9393;">"M-y"</span> . helm-show-kill-ring<span style="color: #D0BF8F;">)</span>
         <span style="color: #D0BF8F;">(</span><span style="color: #CC9393;">"M-x"</span> . helm-M-x<span style="color: #D0BF8F;">)</span>
         <span style="color: #D0BF8F;">(</span><span style="color: #CC9393;">"C-s"</span> . helm-swoop-without-pre-input<span style="color: #D0BF8F;">)</span>
         <span style="color: #D0BF8F;">(</span><span style="color: #CC9393;">"C-h b"</span> . helm-descbinds<span style="color: #D0BF8F;">)</span>
         <span style="color: #D0BF8F;">(</span><span style="color: #CC9393;">"C-h a"</span> . helm-apropos<span style="color: #D0BF8F;">)</span>
         <span style="color: #D0BF8F;">(</span><span style="color: #CC9393;">"C-c p h"</span> . helm-projectile<span style="color: #D0BF8F;">)</span>
         <span style="color: #D0BF8F;">(</span><span style="color: #CC9393;">"C-x r l"</span> . helm-bookmarks<span style="color: #D0BF8F;">)</span>
         <span style="color: #D0BF8F;">(</span><span style="color: #CC9393;">"C-x c m"</span> . helm-all-mark-rings<span style="color: #D0BF8F;">)</span>
         <span style="color: #D0BF8F;">(</span><span style="color: #CC9393;">"C-x c o"</span> . helm-occur<span style="color: #D0BF8F;">)</span>
         <span style="color: #D0BF8F;">(</span><span style="color: #CC9393;">"C-x c r"</span> . helm-recentf<span style="color: #D0BF8F;">)</span>
         <span style="color: #D0BF8F;">(</span><span style="color: #CC9393;">"C-x b"</span> . helm-mini<span style="color: #D0BF8F;">)</span>
         <span style="color: #D0BF8F;">(</span><span style="color: #CC9393;">"C-x C-f"</span> . helm-find-files<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
    <span style="color: #D0BF8F;">(</span>helm-projectile-on<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>helm-autoresize-mode 1<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>helm-mode<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> helm-locate-command <span style="color: #CC9393;">"locate -i -r %s"</span>
          helm-idle-delay 0.0
          helm-input-idle-delay 0.01
          helm-quick-update t
          helm-mode-fuzzy-match t
          helm-ff-skip-boring-files t
          helm-ff-newfile-prompt-p nil
          helm-ff-fuzzy-match t
          helm-yas-display-key-on-candidate t
          helm-locate-fuzzy-match t
          helm-projectile-fuzzy-match t
          helm-recentf-fuzzy-match t
          helm-buffers-fuzzy-match t
          helm-apropos-fuzzy-match t
          helm-M-x-fuzzy-match t
          helm-swoop-move-to-line-cycle nil
          helm-swoop-split-direction 'split-window-vertically
          helm-M-x-requires-pattern nil
          helm-swoop-use-fuzzy-match t
          helm-swoop-split-with-multiple-windows nil
          helm-display-header-line nil<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org34639c4" class="outline-4">
<h4 id="org34639c4"><span class="section-number-4">4.1.14</span> <span class="todo TODO">TODO</span> BACON</h4>
<div class="outline-text-4" id="text-4-1-14">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">beacon</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:diminish</span> beacon-mode
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
    <span style="color: #D0BF8F;">(</span>beacon-mode 1<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> beacon-blink-when-point-moves-vertically nil
          beacon-blink-when-point-moves-horizontally nil
          beacon-blink-when-buffer-changes t
          beacon-blink-when-window-scrolls t
          beacon-blink-when-window-changes t
          beacon-blink-when-focused nil
          beacon-blink-duration 0.3
          beacon-blink-delay 0.3
          beacon-size 20
          beacon-color 0.5<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc1a2497" class="outline-4">
<h4 id="orgc1a2497"><span class="section-number-4">4.1.15</span> <span class="todo TODO">TODO</span> UNDOOTREE</h4>
<div class="outline-text-4" id="text-4-1-15">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">undo-tree</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:diminish</span> undo-tree-mode
  <span style="color: #DCDCCC; font-weight: bold;">:bind</span> <span style="color: #BFEBBF;">(</span><span style="color: #D0BF8F;">(</span><span style="color: #CC9393;">"C-x u"</span> . undo-tree-visualize<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:commands</span> global-undo-tree-mode
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> undo-tree-visualizer-timestamps t
          undo-tree-visualizer-diff nil<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcf8557a" class="outline-4">
<h4 id="orgcf8557a"><span class="section-number-4">4.1.16</span> <span class="todo TODO">TODO</span> RAINBOW-DELIMITERS</h4>
<div class="outline-text-4" id="text-4-1-16">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">rainbow-delimiters</span>
  <span style="color: #DCDCCC; font-weight: bold;">:defer</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:init</span>
  <span style="color: #BFEBBF;">(</span>add-hook 'prog-mode-hook 'rainbow-delimiters-mode<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org3e6eab5" class="outline-4">
<h4 id="org3e6eab5"><span class="section-number-4">4.1.17</span> <span class="todo TODO">TODO</span> EMMS</h4>
<div class="outline-text-4" id="text-4-1-17">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(use-package emms</span>
<span style="color: #5F7F5F;">;;   </span><span style="color: #7F9F7F;">:ensure t</span>
<span style="color: #5F7F5F;">;;   </span><span style="color: #7F9F7F;">:pin melpa-stable</span>
<span style="color: #5F7F5F;">;;   </span><span style="color: #7F9F7F;">:init</span>
<span style="color: #5F7F5F;">;;   </span><span style="color: #7F9F7F;">(progn</span>
<span style="color: #5F7F5F;">;;     </span><span style="color: #7F9F7F;">(emms-player-mpd-update-all)</span>
<span style="color: #5F7F5F;">;;     </span><span style="color: #7F9F7F;">(emms-cache-set-from-mpd-all))</span>
<span style="color: #5F7F5F;">;;   </span><span style="color: #7F9F7F;">:config</span>
<span style="color: #5F7F5F;">;;   </span><span style="color: #7F9F7F;">(progn</span>
<span style="color: #5F7F5F;">;;     </span><span style="color: #7F9F7F;">(setq emms-player-list '(emms-player-mpd)</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">       emms-player-mpd-server-name "localhost"</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">       emms-player-mpd-server-port "6600"</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">       emms-player-mpd-music-directory "~/music"</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">       emms-player-mpd-sync-playlist nil</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">       emms-playing-time-display-p nil</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">       emms-info-functions '(emms-info-mpd)</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">       emms-info-asynchronously nil</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">       emms-info-auto-update t</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">       emms-lyrics-scroll-p nil</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">       emms-lyrics-display-on-minibuffer t</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">       emms-lyrics-display-on-modeline nil</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">       emms-lyrics-dir "~/music/lyrics"</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">       emms-browser-default-covers '("~/music/cover_default.jpg" nil nil)</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">       emms-browser-default-browse-type 'info-album)))</span>
</pre>
</div>
</div>
</div>
