config.org
*** PHP
    #+begin_src emacs-lisp
(use-package php-mode
  :ensure t
  :config
  (progn
    (add-hook 'php-mode-hook (lambda ()
                               (setq indent-tabs-mode nil
                                     tab-width 2
                                     c-basic-offset 2)))
    (bind-key "C-c TAB" 'indent-region php-mode-map)
    (bind-key "C-c C-c" 'glen/toggle-comments php-mode-map)))
    #+end_src
*** RESTCLIENT
    #+begin_src emacs-lisp
 (use-package restclient
   :ensure t
   :init
   (progn
     (add-hook 'restclient-mode-hook (lambda ()
                                       (company-mode 1)
                                       (company-restclient 1)))
     (add-to-list 'auto-mode-alist '("\\.rest$" . restclient-mode))))
    #+end_src
*** INPROGRESS WEB
    #+begin_src emacs-lisp
(use-package web-mode
  :ensure t
  :mode (("\\.html$" . web-mode)
	 ("\\.css$" . web-mode))
  :init
  (progn
    (setq web-mode-markup-indent-offset 2
          web-mode-comment-style 2
          web-mode-css-indent-offset 2
          web-mode-code-indent-offset 2
          web-mode-enable-auto-pairing t
          web-mode-enable-current-element-highlight t
          web-mode-enable-current-column-highlight t)
    (add-hook 'web-mode-hook (lambda ()
                               (set (make-local-variable 'company-backends) '(company-web-html))
                               (company-mode t))))
  :bind
  (("C-c C-c" . web-mode-comment-or-uncomment)))
    #+end_src
*** INPROGRESS COMPANY
    #+begin_src emacs-lisp
 (use-package company
   :ensure helm-company
   :ensure company-restclient
   :ensure company-web
   :pin melpa
   :config
   (progn
     (bind-key "C-:" 'counsel-company company-mode-map)
     (setq company-frontends nil
	   company-backends '(company-restclient company-web-html))))
    #+end_src
*** JS
    #+begin_src emacs-lisp
(use-package js2-mode
  :pin melpa
  :ensure t
  :ensure web-beautify
  :mode (("\\.js$" . js2-mode))
  :commands js2-mode
  :init
  (progn
    (setq-default js-indent-level 2
		  js2-basic-offset 2)
    (add-to-list 'interpreter-mode-alist (cons "node" 'js2-mode)))
  :config
  (progn
    (js2-imenu-extras-setup)
    (bind-key "C-c C-c" 'glen/toggle-comments js2-mode-map)
    (bind-key "C-c TAB" 'web-beautify-js js2-mode-map)
    (bind-key "C-x C-e" 'js-send-last-sexp js2-mode-map)
    (bind-key "C-M-x" 'js-send-last-sexp-and-go js2-mode-map)
    (bind-key "C-c b" 'js-send-buffer js2-mode-map)
    (bind-key "C-c d" 'my/insert-or-flush-debug js2-mode-map)
    (bind-key "C-c C-b" 'js-send-buffer-and-go js2-mode-map)
    (bind-key "C-c w" 'my/copy-javascript-region-or-buffer js2-mode-map)))
    #+end_src
