config.html
<div id="outline-container-org0dd67f0" class="outline-4">
<h4 id="org0dd67f0"><span class="section-number-4">4.1.18</span> PHP</h4>
<div class="outline-text-4" id="text-4-1-18">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">php-mode</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
    <span style="color: #D0BF8F;">(</span>add-hook 'php-mode-hook <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #9FC59F;">()</span>
                               <span style="color: #9FC59F;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> indent-tabs-mode nil
                                     tab-width 2
                                     c-basic-offset 2<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">bind-key</span> <span style="color: #CC9393;">"C-c TAB"</span> 'indent-region php-mode-map<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">bind-key</span> <span style="color: #CC9393;">"C-c C-c"</span> 'glen/toggle-comments php-mode-map<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgffc9f10" class="outline-4">
<h4 id="orgffc9f10"><span class="section-number-4">4.1.19</span> RESTCLIENT</h4>
<div class="outline-text-4" id="text-4-1-19">
<div class="org-src-container">
<pre class="src src-emacs-lisp"> <span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">restclient</span>
   <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
   <span style="color: #DCDCCC; font-weight: bold;">:init</span>
   <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
     <span style="color: #D0BF8F;">(</span>add-hook 'restclient-mode-hook <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #9FC59F;">()</span>
                                       <span style="color: #9FC59F;">(</span>company-mode 1<span style="color: #9FC59F;">)</span>
                                       <span style="color: #9FC59F;">(</span>company-restclient 1<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
     <span style="color: #D0BF8F;">(</span>add-to-list 'auto-mode-alist '<span style="color: #93E0E3;">(</span><span style="color: #CC9393;">"\</span><span style="color: #D0BF8F; font-weight: bold;">\</span><span style="color: #CC9393;">.rest$"</span> . restclient-mode<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbe390d5" class="outline-4">
<h4 id="orgbe390d5"><span class="section-number-4">4.1.20</span> <span class="todo INPROGRESS">INPROGRESS</span> WEB</h4>
<div class="outline-text-4" id="text-4-1-20">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">web-mode</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:mode</span> <span style="color: #BFEBBF;">(</span><span style="color: #D0BF8F;">(</span><span style="color: #CC9393;">"\</span><span style="color: #D0BF8F; font-weight: bold;">\</span><span style="color: #CC9393;">.html$"</span> . web-mode<span style="color: #D0BF8F;">)</span>
         <span style="color: #D0BF8F;">(</span><span style="color: #CC9393;">"\</span><span style="color: #D0BF8F; font-weight: bold;">\</span><span style="color: #CC9393;">.css$"</span> . web-mode<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:init</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> web-mode-markup-indent-offset 2
          web-mode-comment-style 2
          web-mode-css-indent-offset 2
          web-mode-code-indent-offset 2
          web-mode-enable-auto-pairing t
          web-mode-enable-current-element-highlight t
          web-mode-enable-current-column-highlight t<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>add-hook 'web-mode-hook <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #9FC59F;">()</span>
                               <span style="color: #9FC59F;">(</span>set <span style="color: #94BFF3;">(</span>make-local-variable 'company-backends<span style="color: #94BFF3;">)</span> '<span style="color: #94BFF3;">(</span>company-web-html<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
                               <span style="color: #9FC59F;">(</span>company-mode t<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:bind</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #D0BF8F;">(</span><span style="color: #CC9393;">"C-c C-c"</span> . web-mode-comment-or-uncomment<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org3e7da32" class="outline-4">
<h4 id="org3e7da32"><span class="section-number-4">4.1.21</span> <span class="todo INPROGRESS">INPROGRESS</span> COMPANY</h4>
<div class="outline-text-4" id="text-4-1-21">
<div class="org-src-container">
<pre class="src src-emacs-lisp"> <span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">company</span>
   <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> helm-company
   <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> company-restclient
   <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> company-web
   <span style="color: #DCDCCC; font-weight: bold;">:pin</span> melpa
   <span style="color: #DCDCCC; font-weight: bold;">:config</span>
   <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
     <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">bind-key</span> <span style="color: #CC9393;">"C-:"</span> 'counsel-company company-mode-map<span style="color: #D0BF8F;">)</span>
     <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> company-frontends nil
           company-backends '<span style="color: #93E0E3;">(</span>company-restclient company-web-html<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org73c87d7" class="outline-4">
<h4 id="org73c87d7"><span class="section-number-4">4.1.22</span> JS</h4>
<div class="outline-text-4" id="text-4-1-22">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">js2-mode</span>
  <span style="color: #DCDCCC; font-weight: bold;">:pin</span> melpa
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> web-beautify
  <span style="color: #DCDCCC; font-weight: bold;">:mode</span> <span style="color: #BFEBBF;">(</span><span style="color: #D0BF8F;">(</span><span style="color: #CC9393;">"\</span><span style="color: #D0BF8F; font-weight: bold;">\</span><span style="color: #CC9393;">.js$"</span> . js2-mode<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:commands</span> js2-mode
  <span style="color: #DCDCCC; font-weight: bold;">:init</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq-default</span> js-indent-level 2
                  js2-basic-offset 2<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>add-to-list 'interpreter-mode-alist <span style="color: #93E0E3;">(</span>cons <span style="color: #CC9393;">"node"</span> 'js2-mode<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
    <span style="color: #D0BF8F;">(</span>js2-imenu-extras-setup<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">bind-key</span> <span style="color: #CC9393;">"C-c C-c"</span> 'glen/toggle-comments js2-mode-map<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">bind-key</span> <span style="color: #CC9393;">"C-c TAB"</span> 'web-beautify-js js2-mode-map<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">bind-key</span> <span style="color: #CC9393;">"C-x C-e"</span> 'js-send-last-sexp js2-mode-map<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">bind-key</span> <span style="color: #CC9393;">"C-M-x"</span> 'js-send-last-sexp-and-go js2-mode-map<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">bind-key</span> <span style="color: #CC9393;">"C-c b"</span> 'js-send-buffer js2-mode-map<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">bind-key</span> <span style="color: #CC9393;">"C-c d"</span> 'my/insert-or-flush-debug js2-mode-map<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">bind-key</span> <span style="color: #CC9393;">"C-c C-b"</span> 'js-send-buffer-and-go js2-mode-map<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">bind-key</span> <span style="color: #CC9393;">"C-c w"</span> 'my/copy-javascript-region-or-buffer js2-mode-map<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
