config.org
*** ERC
    #+begin_src emacs-lisp
 (setq erc-echo-notices-in-minibuffer-flag t
       erc-fill-column 70
       erc-nick "sireseog"
       erc-keywords '("sireseog")
       erc-track-exclude-types '("JOIN" "NICK" "PART" "QUIT" "MODE"
				 "324" "329" "332" "333" "353" "477")
       erc-hide-list '("JOIN" "PART" "QUIT"))
    #+end_src
*** SKEWER MODE
    #+begin_src emacs-lisp
 (use-package skewer-mode
   :ensure t
   :pin melpa
   :config
   (progn
     (setq httpd-port 1234)
     (add-hook 'web-mode-hook 'skewer-mode)))
    #+end_src
*** IMPATIENT MODE
    #+begin_src emacs-lisp
 (use-package impatient-mode
   :ensure t
   :pin melpa)
    #+end_src
*** IVY
    #+begin_src emacs-lisp
;; (use-package ivy :demand
;;   :diminish (ivy-mode . "")
;;   :pin melpa
;;   :ensure t
;;   :config
;;   (ivy-mode 1)
;;   (progn
;;     (ivy-set-display-transformer 'ivy-switch-buffer 'ivy-rich-switch-buffer-transformer)
;;     (setq ivy-use-virtual-buffers t
;; 	  ivy-initial-inputs-alist nil
;; 	  ivy-re-builders-alist '((t . ivy--regex-fuzzy))
;; 	  ivy-height 10
;; 	  ivy-count-format "")))
    #+end_src
*** COUNSEL
    #+begin_src emacs-lisp
;; (use-package counsel
;;   :pin melpa
;;   :ensure t
;;   :config

;; )
    #+end_src
*** AVY
    #+begin_src emacs-lisp
(use-package avy
  :pin melpa
  :ensure t
  :bind
  (("C-c j" . avy-goto-char)))
    #+end_src
