config.html
<div id="outline-container-org181746f" class="outline-4">
<h4 id="org181746f"><span class="section-number-4">4.1.23</span> ERC</h4>
<div class="outline-text-4" id="text-4-1-23">
<div class="org-src-container">
<pre class="src src-emacs-lisp"> <span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> erc-echo-notices-in-minibuffer-flag t
       erc-fill-column 70
       erc-nick <span style="color: #CC9393;">"sireseog"</span>
       erc-keywords '<span style="color: #BFEBBF;">(</span><span style="color: #CC9393;">"sireseog"</span><span style="color: #BFEBBF;">)</span>
       erc-track-exclude-types '<span style="color: #BFEBBF;">(</span><span style="color: #CC9393;">"JOIN"</span> <span style="color: #CC9393;">"NICK"</span> <span style="color: #CC9393;">"PART"</span> <span style="color: #CC9393;">"QUIT"</span> <span style="color: #CC9393;">"MODE"</span>
                                 <span style="color: #CC9393;">"324"</span> <span style="color: #CC9393;">"329"</span> <span style="color: #CC9393;">"332"</span> <span style="color: #CC9393;">"333"</span> <span style="color: #CC9393;">"353"</span> <span style="color: #CC9393;">"477"</span><span style="color: #BFEBBF;">)</span>
       erc-hide-list '<span style="color: #BFEBBF;">(</span><span style="color: #CC9393;">"JOIN"</span> <span style="color: #CC9393;">"PART"</span> <span style="color: #CC9393;">"QUIT"</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org77dc067" class="outline-4">
<h4 id="org77dc067"><span class="section-number-4">4.1.24</span> SKEWER MODE</h4>
<div class="outline-text-4" id="text-4-1-24">
<div class="org-src-container">
<pre class="src src-emacs-lisp"> <span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">skewer-mode</span>
   <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
   <span style="color: #DCDCCC; font-weight: bold;">:pin</span> melpa
   <span style="color: #DCDCCC; font-weight: bold;">:config</span>
   <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
     <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> httpd-port 1234<span style="color: #D0BF8F;">)</span>
     <span style="color: #D0BF8F;">(</span>add-hook 'web-mode-hook 'skewer-mode<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd8f1b7e" class="outline-4">
<h4 id="orgd8f1b7e"><span class="section-number-4">4.1.25</span> IMPATIENT MODE</h4>
<div class="outline-text-4" id="text-4-1-25">
<div class="org-src-container">
<pre class="src src-emacs-lisp"> <span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">impatient-mode</span>
   <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
   <span style="color: #DCDCCC; font-weight: bold;">:pin</span> melpa<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1ebdecb" class="outline-4">
<h4 id="org1ebdecb"><span class="section-number-4">4.1.26</span> IVY</h4>
<div class="outline-text-4" id="text-4-1-26">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(use-package ivy :demand</span>
<span style="color: #5F7F5F;">;;   </span><span style="color: #7F9F7F;">:diminish (ivy-mode . "")</span>
<span style="color: #5F7F5F;">;;   </span><span style="color: #7F9F7F;">:pin melpa</span>
<span style="color: #5F7F5F;">;;   </span><span style="color: #7F9F7F;">:ensure t</span>
<span style="color: #5F7F5F;">;;   </span><span style="color: #7F9F7F;">:config</span>
<span style="color: #5F7F5F;">;;   </span><span style="color: #7F9F7F;">(ivy-mode 1)</span>
<span style="color: #5F7F5F;">;;   </span><span style="color: #7F9F7F;">(progn</span>
<span style="color: #5F7F5F;">;;     </span><span style="color: #7F9F7F;">(ivy-set-display-transformer 'ivy-switch-buffer 'ivy-rich-switch-buffer-transformer)</span>
<span style="color: #5F7F5F;">;;     </span><span style="color: #7F9F7F;">(setq ivy-use-virtual-buffers t</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">       ivy-initial-inputs-alist nil</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">       ivy-re-builders-alist '((t . ivy--regex-fuzzy))</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">       ivy-height 10</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">       ivy-count-format "")))</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org3e98d90" class="outline-4">
<h4 id="org3e98d90"><span class="section-number-4">4.1.27</span> COUNSEL</h4>
<div class="outline-text-4" id="text-4-1-27">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(use-package counsel</span>
<span style="color: #5F7F5F;">;;   </span><span style="color: #7F9F7F;">:pin melpa</span>
<span style="color: #5F7F5F;">;;   </span><span style="color: #7F9F7F;">:ensure t</span>
<span style="color: #5F7F5F;">;;   </span><span style="color: #7F9F7F;">:config</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org27e1771" class="outline-4">
<h4 id="org27e1771"><span class="section-number-4">4.1.28</span> AVY</h4>
<div class="outline-text-4" id="text-4-1-28">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">avy</span>
  <span style="color: #DCDCCC; font-weight: bold;">:pin</span> melpa
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:bind</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #D0BF8F;">(</span><span style="color: #CC9393;">"C-c j"</span> . avy-goto-char<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: WALID LAARAKI</p>
<p class="date">Created: 2017-09-04 Mon 19:41</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
